---
kind: property
id: P:Autodesk.Revit.DB.Face.IsTwoSided
source: html/ac7f86fd-d6d6-918f-00f4-23d21e5e0c6f.htm
---
# Autodesk.Revit.DB.Face.IsTwoSided Property

Determines if a face is two-sided (degenerate).

## Syntax (C#)
```csharp
public virtual bool IsTwoSided { get; }
```